app/controllers/albums_controller.rb

    def create
        @album = Album.new(album_params)
        if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 2], ["title", "more and more"], ["year", 2012], ["created_at", "2019-04-04 21:56:29.676275"], ["updated_at", "2019-04-04 21:56:29.676275"]]

    def destroy
        album = Album.find_by(id: params[:id])
        band = album.band
        album.delete
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 9]]

    def update
        @album = Album.find_by(id: params[:id])
        if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "band_id" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["year", 2000], ["band_id", 4], ["updated_at", "2019-04-05 00:20:04.130248"], ["id", 13]]

    def edit
        @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]