app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "qsYPRDryrPEL3HFbtFyomA"], ["LIMIT", 1]]
---
    def current_user
        User.find_by(session_token: session[:session_token])