app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "three time is the charm"], ["created_at", "2019-04-04 22:33:44.233519"], ["updated_at", "2019-04-04 22:33:44.233519"]]
---
    def create
        new_band = Band.new(band_params)

        if new_band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
    def destroy
        band = Band.find_by(id: params[:id])
        band.delete

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "three times is the charm"], ["updated_at", "2019-04-04 23:17:09.314054"], ["id", 5]]
---
    def update
        new_band = Band.find_by(id: params[:id])

        if new_band.update(band_params)