app/models/user.rb

    def self.find_by_credentials(user_name, password)
        user = User.find_by(user_name: user_name)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", ""], ["LIMIT", 1]]